InformationRegisters/НастройкаИспользованияШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаИспользованияШаблонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловиеИспользования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаИспользованияШаблонов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИдентификаторДокумента") Тогда
		Запись.ИдентификаторДокумента = Параметры.ИдентификаторДокумента;
	КонецЕсли;
	
	ПроцессыОбработкиДокументов.ЗаполнитьСписокДоступныхИдентификаторов(СписокДоступныхИдентификаторов);
	
	ОписаниеУсловияИспользования = ПроцессыОбработкиДокументов.ПредставлениеОтбораКомпоновщикаНастроек(Запись.УсловиеИспользования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьНастройкиИспользованияШаблона");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Запись.Шаблон) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Шаблон"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Запись.Шаблон",,Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УсловиеИспользованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ИдентификаторДокумента) Тогда
		ПараметрыФормы = Новый Структура("ИдентификаторДокумента, НастройкиОтбора, ЗаголовокОкна",
			Запись.ИдентификаторДокумента,
			Запись.УсловиеИспользования,
			НСтр("ru = 'Установка условия использования'"));
		ОткрытьФорму("ОбщаяФорма.НастройкаОтбора", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловиеИспользованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Запись.УсловиеИспользования = ВыбранноеЗначение.НастройкиОтбора;
		ОписаниеУсловияИспользования = ВыбранноеЗначение.ПредставлениеОтбора;
		Модифицированность = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПроцессыОбработкиДокументовКлиент.ОткрытьФормуВыбораТипаДокумента(
		Элемент, ДанныеВыбора, СтандартнаяОбработка,
		Новый Структура("ТекущаяСтрока", Запись.ИдентификаторДокумента), СписокДоступныхИдентификаторов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУсловияИспользованияОчистка(Элемент, СтандартнаяОбработка)
	
	Запись.УсловиеИспользования = "";
	
КонецПроцедуры

#КонецОбласти
